import React from "react";
import { Separator } from "@/components/ui/separator";
import GeneralInfo from "@/app/(root)/(protected)/profile/[_id]/components/general-info";
import LargeTexts from "@/app/(root)/(protected)/profile/[_id]/components/large-texts";
import { Button, buttonVariants } from "@/components/ui/button";
import { Pencil, BookMarked } from "lucide-react";
import get_me from "@/app/lib/get-me";
import Link from "next/link";
import Interests from "./components/interests";

export default async function Profile({ params }: { params: { _id: string } }) {
    const me = await get_me();
    const { _id } = await params;
    const name_string_1 = "ကြိုက်ကုန်းဖာသယ်မ"; // length 20
    console.log(name_string_1.length);
    console.log(status_message().length); // length 550
    console.log(about_me().length); // length 3000
    interests().forEach(element => {
        // array length 5
        console.log(element.length); // length 50
    });
    const gender = "female";
    const age = 22;
    const region = "Myanmar";
    const username = "slvty_khine";
    return (
        <>
            <div className="mb-10">
                <div>
                    <GeneralInfo username={username} name={name_string_1} gender={gender} age={age} region={region} _id={_id} />
                    { me?._id && me._id === _id && (
                      <div className="mt-4">
                          <Link href={`/profile/${_id}/edit`} className={ buttonVariants({ variant : 'secondary'})}>
                              <Pencil />
                              Edit
                          </Link>
                      </div>
                    )}
                    { me?._id && me._id !== _id && (
                      <div className="mt-4">
                          <Button className="px-9 bg-green-400 text-black" variant="secondary">
                              <BookMarked />
                              Save User
                          </Button>
                      </div>
                    )}
                </div>
                <Separator className="my-5"></Separator>
                <div>
                    <Interests interests={interests()} />
                </div>
                <Separator className="my-5"></Separator>
                <div>
                    <LargeTexts title="Status Message" body={status_message()} />
                </div>
                <Separator className="my-5"></Separator>
                <div>
                    <LargeTexts title="About Me" body={about_me()} />
                </div>
            </div>
        </>
    );
}

function status_message(): string {
    return `ခိုင့်မှာရည်းစားရှိတယ် သူမသိအောင်လီးအကြီးတွေထိုးထည့်ပြီး အလိုးခံအဆဲခံချင်တာ ကောင်လေးအိပ်နေတုန်းဘေးမှာတခြားလီးကြီးတွေနဲ့ဖာခံချင်တာ သူ တန်းဖိုးထားတဲ့မိန်းမပျက်ဖာသယ်မကြီးကို သူ့မသိအောင်ဝိုင်းလိုးပေးတာခံချင်တာ ဘဲမသိအောင်ခိုးခံချင်တဲ့မျက်မှန်နဲ့ ထဘီနဲ့ဖင်ကြီးကြီး နို့ကြီးကြီးဖာသည်မခိုင်ကို တန်းဖိုးတစက်မှမထားပဲ ပက်ပက်စက်စက် ဖာဇာတ်သွင်းပေးတာခံချင်တာ တကယ်လို့သူသိသွားရင်လည်း သူ့ရည်းစားဖာဆန်ကြောင်းသိ‌‌အောင်သူ့ရှေ့မှာ မဖြစ်စလောက် ၁၀၀၀‌ တောင်မကျော်တဲ့ပိုက်ဆံလေးနဲ့‌ ဈေးဖြတ်ခံရပြီး ဖာခံချင်တာ`;
}

function about_me(): string {
    return `အလိုးခံရတာထက် ဖာဆန်ပြီး  လာလိုး‌အောင်အထာပေးရတာပိုကြိုက်တာ ဒီခိုင်ဆိုတဲ့ဖာကောင်မကြီးက‌ လေညုတုတုဖြစ်နေတဲ့ရုပ်နဲ့ စောက်ရည်တွေကွက်နေတဲ့ထဘီနဲ့ အင်းကျီပေါ်ကိုထင်းနေအောင်ထောင်နေတဲ့နို့သီးတွေနဲ့ တက်မလိုးရမနေနိုင် ဖြစ်အောင် ယောကျာ်းတကာလီးတောင်အောင်မြူစွယ်ချင်တာ အိမ်မှာတစ်ယောက်တည်းရှိတာနဲ့ ဘယ်တော့မှတံခါး‌ သော့မပိတ်ဘူး လမ်းပေါ်ကကောင်တွေအိမ်ပေါ်တက်လာပီး စော်ကားတာခံချင်လို့ လမ်းသွားရင်းလဲကံကောင်းရင် ခိုင့်အိမ်ထဲမှားဝင်လာမိပြီး ခိုင့်ကိုတက်လိုးရနိုင်ချေရှိတယ်သိလား ဘယ်ကမှန်းမသိတဲ့သူစိမ်းကို ‌အိမ်ပေါ်ခေါ်ပီး စောက်ဖုတ်ပြရတာမျိုးမှခိုင်ကသဘောကျတာ ခိုင့်စောက်ဖုတ်ကြီးပြထားပီး အမှန်းခံနေရတာမျိုးဆိုအရမ်းကောင်းမှာပဲ အား … ကြည့်ရင်းတအားထန်ပြီးလီးတောင်လာအောင်စောက်ဖုတ်ကြီးကိုပွတ်ပြချင်လိုက်တာ လမ်းပေါ်ကတွေ့တဲ့သူစိမ်းကောင်ရဲ့ရှေ့မှာ စောက်ဖုတ်ပွတ်ပြရင်း စောက်ပေါက်ထဲကလှိုက်ပီးယားလာလို့ ပါးစပ်ကပါသားရည်တွေကျပြီး လီးဆာတဲ့ထိကိုဖြစ်ပြချင်တာ ခိုင့်ဘာခိုင်ပွတ်ရတာညောင်းလာရင် “အကိုရယ် အကို့လက်ကြီးနဲ့ ခိုင့်စောက်ပတ်ကြီးကို ဖြဲပြီးပွတ်ပေးပါဦး” လို့ပြောပြီး ဖာဆန်ပြမှာကွာ စောက်ရည်တွေစီးကျပြီး စောက်သံတွေကတပက်ပက်နဲ့အသံထွက်နေတဲ့ထိကို အပွတ်ခံချင်တာ ခိုင့် ဖင်ကြီးကြွတက်ပီးကော့ကော့ထိုးလာတဲ့ထိကို သူစိမ်းစောက်ဖုတ်ပွတ်တာခံချင်တာ ခိုင့်ရဲ့ဖာသယ်မပါးစပ်ကနေလဲ "စောက်ဖုတ်ကြီးကယားနေတာဆိုတော့ အကြိုက်ဖစ်သွားတာပဲအကိုရယ် အား မွှေပေးပါအုံး အာ့လက်ချောင်းတွေနဲ့ မွှေပေးပါ အရမ်းကြိုက်တယ် ဒီလောက်ထန်တဲ့ဒီကောင်မကို ဖင်ကြီးမြောက်တက်ပီး စောက်ဖုတ်ကြီးကပြဲအာ လာတဲ့ထိဖြဲပြီးမညှာမတာပွတ်ပစ်စမ်းပါ” ဆိုပြီး ပွတ်ရတဲ့လူအားတက်အောင်ပြောပေးနေမိမှာ စောက်ဖုတ်အပွတ်ခံရင်း “အကို့လီးကလဲ အကြီးကြီးပဲ ထုရတာအားရလိုက်တာ အား စောက်လီးကြီးက အကြောတေထောင်နေတာ” လို့အော်ပြီးသူစိမ်းလီးကိုအငမ်းမရဂွင်းထုပေးချင်တာ စောက်ဖုတ်အနှိုက်ခံရတာ ဝရင် ပါးစပ်ကိုအလိုးခံမယ် ဒူးထောက်ပြီး ပါးစပ်ဟထားပေးမယ် သားရည်တွေစီးကျနေတဲ့ခိုင့်ပါးစပ်ကို အားကုန် မညှာမတာ လီးကြီးနဲ့စောင့်စောင့်ပြီးထည့်တာ ခံပစ်ချင်တာ ‌ခိုင့် ပါးစပ်ပေါက်ကလဲ အောက်ကစောက်ပေါက်လိုပဲ နွေးပြီး လိုးရတဲ့လီးကအရမ်းအရသာရှိနေမှာ ပြီးရင်တော့စောက်ပက်လိုးလိုးဖင်လိုးလိုး လိုးချင်တဲ့အပေါက်လိုးလို့ရအောင် ခွေးမလိုလေးဘက်ထောက်ကုန်းထားပေးမှာ ဒီဖာကောင်မရဲ့ ဖင်ကြီးကိုခွပြီး စိတ်ကြိုက်သာလိုး အလိုးခံရင်း “ခုလိုလမ်းက‌ တွေ့တဲ့လူတက်လိုးတာခံချင်နေတာကြာပြီအကိုရယ် ခါးကျိုးအောင်သာစောင့်လိုးစမ်းပါ စောက်ရမ်းထန်တဲ့ကောင်မရဲ့စောက်ပက်ကို လိုးပေးစမ်းပါ လမ်းသွားရင်း သူများအိမ်ထဲဝင်လာပြီး တက်လိုးနေရတာ ကြိုက်လား ကြမ်းပြင်ကိုမျက်နှာအပ်ပီးကုန်းထားတဲ့ အထန်မရဲ့ဖင်ကိုကိုင်ပီး လီးကိုစောက်ပက်ထဲဆောင့်ဆောင့်ပီးလိုးခွဲပေး ဖင်ကြီးတုန်တုန်ပီး နို့တွေကပါရမ်းနေ အောင်လိုးပေးပါ အာ့ ကြိုက်လား ခိုင့်ဖင်ကြီးရိုက်လိုးရတော့ အကို့လီးကြီးပိုတောင်လာတယ်မလားဟင် စောက်ပက်ထဲရစရာမရှိအောင်ထိုးမွှေပေး အရမ်းကြိုက်တယ် အကိုရယ်" လို့ အော်ဟစ် ဖာသံတွေပေးပြီးအားရပါးရခံပစ်မှာ ဒီစောက်ကောင်မ ဖင်ပြောင်မရဲ့ ဖင်ကြီးက သူစိမ်းလိုးတိုင်း တုန်ခါ‌ပြီး ရှယ်ကားထွက်နေမှာ အနှိုက်ခံထားရလို့ မလိုးခင်ထဲကပြဲလန်နေတဲ့စောက်ပက်ကြီးနဲ့ ခွေးမကြီးလို မြင်မကောင်းအောင် ကုန်းခံပစ်မှာ သားအိမ်ထဲလရည်တွေပန်းထည့်ခံရပြီး ‌ဗိုက်ကြီးချင်တာကွာ ခိုင့်ကိုအဲ့လိုမလိုးပေးချင်ဘူးလားဟင် စောက်ပက်ယားတိုင်း အိမ်ပေါက်ဝကနေ လမ်းပေါ်စောက်ပက်လှန်ပြ ဖြဲပြ နေတဲ့ကောင်မကိုတွေ့ရင်ဝင်လိုးကြပါနော်`;
}

function interests(): Array<string> {
    return ["စောက်ပတ်ထဲ လီးသုံးချောင်း တပြိုင်ထဲအသွင်းခံရတာ", "တွေ့ရာလူကို ဖင်ကုန်းပေးရတာ", "ဝဲစားနေတဲ့ လီးကြီးတွေစုပ်ရတာ", "လမ်းဘေးကဆိုက်ကားသမားတွေ တက်လိုးတာခံရတာ", "ညစ်တီးညစ်ပတ်ဆဲဆို အလိုးခံရတာ"];
}
